Revit 2027 API
Parameter.Set Method
Sets the parameter to a new value.
Overload List
Name | Description
Set(Double) | Sets the parameter to a new real number value.
Set(ElementId) | Sets the parameter to a new element id.
Set(Int32) | Sets the parameter to a new integer value.
Set(String) | Sets the parameter to a new string of text.
Top
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace